keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxXbar_bf.h
/** \\brief  Length for Ifx_XBAR_ARBCON_Bits.INTACK */
#define IFX_XBAR_ARBCON_INTACK_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBCON_Bits.INTACK */
#define IFX_XBAR_ARBCON_INTACK_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBCON_Bits.INTACK */
#define IFX_XBAR_ARBCON_INTACK_OFF (4)

/** \\brief  Length for Ifx_XBAR_ARBCON_Bits.PRERREN */
#define IFX_XBAR_ARBCON_PRERREN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBCON_Bits.PRERREN */
#define IFX_XBAR_ARBCON_PRERREN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBCON_Bits.PRERREN */
#define IFX_XBAR_ARBCON_PRERREN_OFF (0)

/** \\brief  Length for Ifx_XBAR_ARBCON_Bits.SCERREN */
#define IFX_XBAR_ARBCON_SCERREN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBCON_Bits.SCERREN */
#define IFX_XBAR_ARBCON_SCERREN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBCON_Bits.SCERREN */
#define IFX_XBAR_ARBCON_SCERREN_OFF (1)

/** \\brief  Length for Ifx_XBAR_ARBCON_Bits.SETPRINT */
#define IFX_XBAR_ARBCON_SETPRINT_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBCON_Bits.SETPRINT */
#define IFX_XBAR_ARBCON_SETPRINT_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBCON_Bits.SETPRINT */
#define IFX_XBAR_ARBCON_SETPRINT_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBCON_Bits.SETSCINT */
#define IFX_XBAR_ARBCON_SETSCINT_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBCON_Bits.SETSCINT */
#define IFX_XBAR_ARBCON_SETSCINT_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBCON_Bits.SETSCINT */
#define IFX_XBAR_ARBCON_SETSCINT_OFF (3)

/** \\brief  Length for Ifx_XBAR_ARBCON_Bits.SPC */
#define IFX_XBAR_ARBCON_SPC_LEN (12)

/** \\brief  Mask for Ifx_XBAR_ARBCON_Bits.SPC */
#define IFX_XBAR_ARBCON_SPC_MSK (0xfff)

/** \\brief  Offset for Ifx_XBAR_ARBCON_Bits.SPC */
#define IFX_XBAR_ARBCON_SPC_OFF (20)

/** \\brief  Length for Ifx_XBAR_ARBITER0_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER0_DBADD_ADDRESS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER0_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER0_DBADD_ADDRESS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER0_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER0_DBADD_ADDRESS_OFF (27)

/** \\brief  Length for Ifx_XBAR_ARBITER0_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER0_DBMADD_ADDRESS_LEN (19)

/** \\brief  Mask for Ifx_XBAR_ARBITER0_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER0_DBMADD_ADDRESS_MSK (0x7ffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER0_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER0_DBMADD_ADDRESS_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER1_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER1_DBADD_ADDRESS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER1_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER1_DBADD_ADDRESS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER1_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER1_DBADD_ADDRESS_OFF (31)

/** \\brief  Length for Ifx_XBAR_ARBITER1_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER1_DBMADD_ADDRESS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER1_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER1_DBMADD_ADDRESS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER1_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER1_DBMADD_ADDRESS_OFF (31)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS_OFF (31)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS_OFF (31)

/** \\brief  Length for Ifx_XBAR_ARBITER4_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER4_DBADD_ADDRESS_LEN (29)

/** \\brief  Mask for Ifx_XBAR_ARBITER4_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER4_DBADD_ADDRESS_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER4_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER4_DBADD_ADDRESS_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER4_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER4_DBMADD_ADDRESS_LEN (29)

/** \\brief  Mask for Ifx_XBAR_ARBITER4_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER4_DBMADD_ADDRESS_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER4_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER4_DBMADD_ADDRESS_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER5_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER5_DBADD_ADDRESS_LEN (29)

/** \\brief  Mask for Ifx_XBAR_ARBITER5_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER5_DBADD_ADDRESS_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER5_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER5_DBADD_ADDRESS_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER5_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER5_DBMADD_ADDRESS_LEN (29)

/** \\brief  Mask for Ifx_XBAR_ARBITER5_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER5_DBMADD_ADDRESS_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER5_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER5_DBMADD_ADDRESS_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS0_LEN (25)

/** \\brief  Mask for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS0_MSK (0x1ffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS0_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS1_LEN (3)

/** \\brief  Mask for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS1_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS1_OFF (28)

/** \\brief  Length for Ifx_XBAR_ARBITER6_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER6_DBADD_ONE0_LEN (1)

