keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxXbar_bf.h
/** \\brief  Mask for Ifx_XBAR_ARBITER6_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER6_DBADD_ONE0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER6_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER6_DBADD_ONE0_OFF (27)

/** \\brief  Length for Ifx_XBAR_ARBITER6_DBADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER6_DBADD_ONE1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER6_DBADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER6_DBADD_ONE1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER6_DBADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER6_DBADD_ONE1_OFF (31)

/** \\brief  Length for Ifx_XBAR_ARBITER6_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER6_DBMADD_ADDRESS_LEN (3)

/** \\brief  Mask for Ifx_XBAR_ARBITER6_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER6_DBMADD_ADDRESS_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_ARBITER6_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER6_DBMADD_ADDRESS_OFF (28)

/** \\brief  Length for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS0_LEN (19)

/** \\brief  Mask for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS0_MSK (0x7ffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS0_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS1_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS0_LEN (19)

/** \\brief  Mask for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS0_MSK (0x7ffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS0_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS1_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITER8_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER8_DBADD_ONE0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER8_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER8_DBADD_ONE0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER8_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER8_DBADD_ONE0_OFF (21)

/** \\brief  Length for Ifx_XBAR_ARBITER8_DBADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER8_DBADD_ONE1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER8_DBADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER8_DBADD_ONE1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER8_DBADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER8_DBADD_ONE1_OFF (31)

/** \\brief  Length for Ifx_XBAR_ARBITER8_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER8_DBMADD_ADDRESS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER8_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER8_DBMADD_ADDRESS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER8_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER8_DBMADD_ADDRESS_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITER9_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER9_DBADD_ADDRESS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER9_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER9_DBADD_ADDRESS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER9_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER9_DBADD_ADDRESS_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITER9_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER9_DBMADD_ADDRESS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER9_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER9_DBMADD_ADDRESS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER9_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER9_DBMADD_ADDRESS_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITERD_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITERD_DBADD_ADDRESS_LEN (30)

/** \\brief  Mask for Ifx_XBAR_ARBITERD_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITERD_DBADD_ADDRESS_MSK (0x3fffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITERD_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITERD_DBADD_ADDRESS_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITERD_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITERD_DBMADD_ADDRESS_LEN (32)

/** \\brief  Mask for Ifx_XBAR_ARBITERD_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITERD_DBMADD_ADDRESS_MSK (0xffffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITERD_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITERD_DBMADD_ADDRESS_OFF (0)

/** \\brief  Length for Ifx_XBAR_DBADD10_Bits.ADDRESS */
#define IFX_XBAR_DBADD10_ADDRESS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBADD10_Bits.ADDRESS */
#define IFX_XBAR_DBADD10_ADDRESS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBADD10_Bits.ADDRESS */
#define IFX_XBAR_DBADD10_ADDRESS_OFF (29)

/** \\brief  Length for Ifx_XBAR_DBCON10_Bits.ADDEN */
#define IFX_XBAR_DBCON10_ADDEN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON10_Bits.ADDEN */
#define IFX_XBAR_DBCON10_ADDEN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON10_Bits.ADDEN */
#define IFX_XBAR_DBCON10_ADDEN_OFF (19)

/** \\brief  Length for Ifx_XBAR_DBCON10_Bits.DBEN */
#define IFX_XBAR_DBCON10_DBEN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON10_Bits.DBEN */
#define IFX_XBAR_DBCON10_DBEN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON10_Bits.DBEN */
#define IFX_XBAR_DBCON10_DBEN_OFF (0)

