keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxXbar_bf.h
/** \\brief  Length for Ifx_XBAR_DBCON10_Bits.DBSAT */
#define IFX_XBAR_DBCON10_DBSAT_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON10_Bits.DBSAT */
#define IFX_XBAR_DBCON10_DBSAT_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON10_Bits.DBSAT */
#define IFX_XBAR_DBCON10_DBSAT_OFF (1)

/** \\brief  Length for Ifx_XBAR_DBCON10_Bits.ERREN */
#define IFX_XBAR_DBCON10_ERREN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON10_Bits.ERREN */
#define IFX_XBAR_DBCON10_ERREN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON10_Bits.ERREN */
#define IFX_XBAR_DBCON10_ERREN_OFF (20)

/** \\brief  Length for Ifx_XBAR_DBCON10_Bits.MASEN */
#define IFX_XBAR_DBCON10_MASEN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON10_Bits.MASEN */
#define IFX_XBAR_DBCON10_MASEN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON10_Bits.MASEN */
#define IFX_XBAR_DBCON10_MASEN_OFF (23)

/** \\brief  Length for Ifx_XBAR_DBCON10_Bits.MASTER */
#define IFX_XBAR_DBCON10_MASTER_LEN (6)

/** \\brief  Mask for Ifx_XBAR_DBCON10_Bits.MASTER */
#define IFX_XBAR_DBCON10_MASTER_MSK (0x3f)

/** \\brief  Offset for Ifx_XBAR_DBCON10_Bits.MASTER */
#define IFX_XBAR_DBCON10_MASTER_OFF (24)

/** \\brief  Length for Ifx_XBAR_DBCON10_Bits.RDEN */
#define IFX_XBAR_DBCON10_RDEN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON10_Bits.RDEN */
#define IFX_XBAR_DBCON10_RDEN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON10_Bits.RDEN */
#define IFX_XBAR_DBCON10_RDEN_OFF (16)

/** \\brief  Length for Ifx_XBAR_DBCON10_Bits.REARM */
#define IFX_XBAR_DBCON10_REARM_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON10_Bits.REARM */
#define IFX_XBAR_DBCON10_REARM_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON10_Bits.REARM */
#define IFX_XBAR_DBCON10_REARM_OFF (2)

/** \\brief  Length for Ifx_XBAR_DBCON10_Bits.SETDBEVT */
#define IFX_XBAR_DBCON10_SETDBEVT_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON10_Bits.SETDBEVT */
#define IFX_XBAR_DBCON10_SETDBEVT_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON10_Bits.SETDBEVT */
#define IFX_XBAR_DBCON10_SETDBEVT_OFF (3)

/** \\brief  Length for Ifx_XBAR_DBCON10_Bits.SVMEN */
#define IFX_XBAR_DBCON10_SVMEN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON10_Bits.SVMEN */
#define IFX_XBAR_DBCON10_SVMEN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON10_Bits.SVMEN */
#define IFX_XBAR_DBCON10_SVMEN_OFF (18)

/** \\brief  Length for Ifx_XBAR_DBCON10_Bits.WREN */
#define IFX_XBAR_DBCON10_WREN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON10_Bits.WREN */
#define IFX_XBAR_DBCON10_WREN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON10_Bits.WREN */
#define IFX_XBAR_DBCON10_WREN_OFF (17)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.ADDEN */
#define IFX_XBAR_DBCON_ADDEN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.ADDEN */
#define IFX_XBAR_DBCON_ADDEN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.ADDEN */
#define IFX_XBAR_DBCON_ADDEN_OFF (19)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.DBEN */
#define IFX_XBAR_DBCON_DBEN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.DBEN */
#define IFX_XBAR_DBCON_DBEN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.DBEN */
#define IFX_XBAR_DBCON_DBEN_OFF (0)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.DBSAT */
#define IFX_XBAR_DBCON_DBSAT_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.DBSAT */
#define IFX_XBAR_DBCON_DBSAT_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.DBSAT */
#define IFX_XBAR_DBCON_DBSAT_OFF (1)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.ERREN */
#define IFX_XBAR_DBCON_ERREN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.ERREN */
#define IFX_XBAR_DBCON_ERREN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.ERREN */
#define IFX_XBAR_DBCON_ERREN_OFF (20)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.MASEN */
#define IFX_XBAR_DBCON_MASEN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.MASEN */
#define IFX_XBAR_DBCON_MASEN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.MASEN */
#define IFX_XBAR_DBCON_MASEN_OFF (23)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.MASTER */
#define IFX_XBAR_DBCON_MASTER_LEN (6)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.MASTER */
#define IFX_XBAR_DBCON_MASTER_MSK (0x3f)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.MASTER */
#define IFX_XBAR_DBCON_MASTER_OFF (24)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.RDEN */
#define IFX_XBAR_DBCON_RDEN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.RDEN */
#define IFX_XBAR_DBCON_RDEN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.RDEN */
#define IFX_XBAR_DBCON_RDEN_OFF (16)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.REARM */
#define IFX_XBAR_DBCON_REARM_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.REARM */
#define IFX_XBAR_DBCON_REARM_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.REARM */
#define IFX_XBAR_DBCON_REARM_OFF (2)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.SETDBEVT */
#define IFX_XBAR_DBCON_SETDBEVT_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.SETDBEVT */
#define IFX_XBAR_DBCON_SETDBEVT_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.SETDBEVT */
#define IFX_XBAR_DBCON_SETDBEVT_OFF (3)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.SVMEN */
#define IFX_XBAR_DBCON_SVMEN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.SVMEN */
#define IFX_XBAR_DBCON_SVMEN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.SVMEN */
#define IFX_XBAR_DBCON_SVMEN_OFF (18)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.WREN */
#define IFX_XBAR_DBCON_WREN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.WREN */
#define IFX_XBAR_DBCON_WREN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.WREN */
#define IFX_XBAR_DBCON_WREN_OFF (17)

/** \\brief  Length for Ifx_XBAR_DBMADD10_Bits.ADDRESS */
#define IFX_XBAR_DBMADD10_ADDRESS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBMADD10_Bits.ADDRESS */
#define IFX_XBAR_DBMADD10_ADDRESS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBMADD10_Bits.ADDRESS */
#define IFX_XBAR_DBMADD10_ADDRESS_OFF (29)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI0 */
#define IFX_XBAR_DBSAT_SCI0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI0 */
#define IFX_XBAR_DBSAT_SCI0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI0 */
#define IFX_XBAR_DBSAT_SCI0_OFF (0)

