keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxXbar_bf.h
/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI10 */
#define IFX_XBAR_DBSAT_SCI10_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI10 */
#define IFX_XBAR_DBSAT_SCI10_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI10 */
#define IFX_XBAR_DBSAT_SCI10_OFF (10)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI1 */
#define IFX_XBAR_DBSAT_SCI1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI1 */
#define IFX_XBAR_DBSAT_SCI1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI1 */
#define IFX_XBAR_DBSAT_SCI1_OFF (1)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI2 */
#define IFX_XBAR_DBSAT_SCI2_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI2 */
#define IFX_XBAR_DBSAT_SCI2_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI2 */
#define IFX_XBAR_DBSAT_SCI2_OFF (2)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI4 */
#define IFX_XBAR_DBSAT_SCI4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI4 */
#define IFX_XBAR_DBSAT_SCI4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI4 */
#define IFX_XBAR_DBSAT_SCI4_OFF (4)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI5 */
#define IFX_XBAR_DBSAT_SCI5_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI5 */
#define IFX_XBAR_DBSAT_SCI5_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI5 */
#define IFX_XBAR_DBSAT_SCI5_OFF (5)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI6 */
#define IFX_XBAR_DBSAT_SCI6_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI6 */
#define IFX_XBAR_DBSAT_SCI6_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI6 */
#define IFX_XBAR_DBSAT_SCI6_OFF (6)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI7 */
#define IFX_XBAR_DBSAT_SCI7_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI7 */
#define IFX_XBAR_DBSAT_SCI7_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI7 */
#define IFX_XBAR_DBSAT_SCI7_OFF (7)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI8 */
#define IFX_XBAR_DBSAT_SCI8_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI8 */
#define IFX_XBAR_DBSAT_SCI8_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI8 */
#define IFX_XBAR_DBSAT_SCI8_OFF (8)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI9 */
#define IFX_XBAR_DBSAT_SCI9_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI9 */
#define IFX_XBAR_DBSAT_SCI9_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI9 */
#define IFX_XBAR_DBSAT_SCI9_OFF (9)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCID */
#define IFX_XBAR_DBSAT_SCID_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCID */
#define IFX_XBAR_DBSAT_SCID_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCID */
#define IFX_XBAR_DBSAT_SCID_OFF (15)

/** \\brief  Length for Ifx_XBAR_ERR10_Bits.ADDR_ECC */
#define IFX_XBAR_ERR10_ADDR_ECC_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ERR10_Bits.ADDR_ECC */
#define IFX_XBAR_ERR10_ADDR_ECC_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ERR10_Bits.ADDR_ECC */
#define IFX_XBAR_ERR10_ADDR_ECC_OFF (16)

/** \\brief  Length for Ifx_XBAR_ERR10_Bits.MCI_SBS */
#define IFX_XBAR_ERR10_MCI_SBS_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ERR10_Bits.MCI_SBS */
#define IFX_XBAR_ERR10_MCI_SBS_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ERR10_Bits.MCI_SBS */
#define IFX_XBAR_ERR10_MCI_SBS_OFF (24)

/** \\brief  Length for Ifx_XBAR_ERR10_Bits.OPC */
#define IFX_XBAR_ERR10_OPC_LEN (4)

/** \\brief  Mask for Ifx_XBAR_ERR10_Bits.OPC */
#define IFX_XBAR_ERR10_OPC_MSK (0xf)

/** \\brief  Offset for Ifx_XBAR_ERR10_Bits.OPC */
#define IFX_XBAR_ERR10_OPC_OFF (4)

/** \\brief  Length for Ifx_XBAR_ERR10_Bits.RD */
#define IFX_XBAR_ERR10_RD_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ERR10_Bits.RD */
#define IFX_XBAR_ERR10_RD_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ERR10_Bits.RD */
#define IFX_XBAR_ERR10_RD_OFF (0)

/** \\brief  Length for Ifx_XBAR_ERR10_Bits.SVM */
#define IFX_XBAR_ERR10_SVM_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ERR10_Bits.SVM */
#define IFX_XBAR_ERR10_SVM_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ERR10_Bits.SVM */
#define IFX_XBAR_ERR10_SVM_OFF (2)

/** \\brief  Length for Ifx_XBAR_ERR10_Bits.TR_ID */
#define IFX_XBAR_ERR10_TR_ID_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ERR10_Bits.TR_ID */
#define IFX_XBAR_ERR10_TR_ID_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ERR10_Bits.TR_ID */
#define IFX_XBAR_ERR10_TR_ID_OFF (8)

/** \\brief  Length for Ifx_XBAR_ERR10_Bits.WR */
#define IFX_XBAR_ERR10_WR_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ERR10_Bits.WR */
#define IFX_XBAR_ERR10_WR_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ERR10_Bits.WR */
#define IFX_XBAR_ERR10_WR_OFF (1)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.ADDR_ECC */
#define IFX_XBAR_ERR_ADDR_ECC_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.ADDR_ECC */
#define IFX_XBAR_ERR_ADDR_ECC_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.ADDR_ECC */
#define IFX_XBAR_ERR_ADDR_ECC_OFF (16)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.MCI_SBS */
#define IFX_XBAR_ERR_MCI_SBS_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.MCI_SBS */
#define IFX_XBAR_ERR_MCI_SBS_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.MCI_SBS */
#define IFX_XBAR_ERR_MCI_SBS_OFF (24)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.OPC */
#define IFX_XBAR_ERR_OPC_LEN (4)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.OPC */
#define IFX_XBAR_ERR_OPC_MSK (0xf)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.OPC */
#define IFX_XBAR_ERR_OPC_OFF (4)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.RD */
#define IFX_XBAR_ERR_RD_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.RD */
#define IFX_XBAR_ERR_RD_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.RD */
#define IFX_XBAR_ERR_RD_OFF (0)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.SVM */
#define IFX_XBAR_ERR_SVM_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.SVM */
#define IFX_XBAR_ERR_SVM_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.SVM */
#define IFX_XBAR_ERR_SVM_OFF (2)

