keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxXbar_bf.h
/** \\brief  Length for Ifx_XBAR_ERR_Bits.TR_ID */
#define IFX_XBAR_ERR_TR_ID_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.TR_ID */
#define IFX_XBAR_ERR_TR_ID_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.TR_ID */
#define IFX_XBAR_ERR_TR_ID_OFF (8)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.WR */
#define IFX_XBAR_ERR_WR_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.WR */
#define IFX_XBAR_ERR_WR_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.WR */
#define IFX_XBAR_ERR_WR_OFF (1)

/** \\brief  Length for Ifx_XBAR_ERRADDR10_Bits.ADDR */
#define IFX_XBAR_ERRADDR10_ADDR_LEN (32)

/** \\brief  Mask for Ifx_XBAR_ERRADDR10_Bits.ADDR */
#define IFX_XBAR_ERRADDR10_ADDR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_XBAR_ERRADDR10_Bits.ADDR */
#define IFX_XBAR_ERRADDR10_ADDR_OFF (0)

/** \\brief  Length for Ifx_XBAR_ERRADDR_Bits.ADDR */
#define IFX_XBAR_ERRADDR_ADDR_LEN (32)

/** \\brief  Mask for Ifx_XBAR_ERRADDR_Bits.ADDR */
#define IFX_XBAR_ERRADDR_ADDR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_XBAR_ERRADDR_Bits.ADDR */
#define IFX_XBAR_ERRADDR_ADDR_OFF (0)

/** \\brief  Length for Ifx_XBAR_EXTCOND_Bits.FREQDISF */
#define IFX_XBAR_EXTCOND_FREQDISF_LEN (1)

/** \\brief  Mask for Ifx_XBAR_EXTCOND_Bits.FREQDISF */
#define IFX_XBAR_EXTCOND_FREQDISF_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_EXTCOND_Bits.FREQDISF */
#define IFX_XBAR_EXTCOND_FREQDISF_OFF (6)

/** \\brief  Length for Ifx_XBAR_EXTCOND_Bits.MAX_WS */
#define IFX_XBAR_EXTCOND_MAX_WS_LEN (7)

/** \\brief  Mask for Ifx_XBAR_EXTCOND_Bits.MAX_WS */
#define IFX_XBAR_EXTCOND_MAX_WS_MSK (0x7f)

/** \\brief  Offset for Ifx_XBAR_EXTCOND_Bits.MAX_WS */
#define IFX_XBAR_EXTCOND_MAX_WS_OFF (13)

/** \\brief  Length for Ifx_XBAR_EXTCOND_Bits.NODELTR */
#define IFX_XBAR_EXTCOND_NODELTR_LEN (1)

/** \\brief  Mask for Ifx_XBAR_EXTCOND_Bits.NODELTR */
#define IFX_XBAR_EXTCOND_NODELTR_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_EXTCOND_Bits.NODELTR */
#define IFX_XBAR_EXTCOND_NODELTR_OFF (9)

/** \\brief  Length for Ifx_XBAR_EXTCOND_Bits.NORMW */
#define IFX_XBAR_EXTCOND_NORMW_LEN (1)

/** \\brief  Mask for Ifx_XBAR_EXTCOND_Bits.NORMW */
#define IFX_XBAR_EXTCOND_NORMW_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_EXTCOND_Bits.NORMW */
#define IFX_XBAR_EXTCOND_NORMW_OFF (10)

/** \\brief  Length for Ifx_XBAR_EXTCOND_Bits.WFWD */
#define IFX_XBAR_EXTCOND_WFWD_LEN (1)

/** \\brief  Mask for Ifx_XBAR_EXTCOND_Bits.WFWD */
#define IFX_XBAR_EXTCOND_WFWD_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_EXTCOND_Bits.WFWD */
#define IFX_XBAR_EXTCOND_WFWD_OFF (3)

/** \\brief  Length for Ifx_XBAR_ID_Bits.MOD_REV */
#define IFX_XBAR_ID_MOD_REV_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ID_Bits.MOD_REV */
#define IFX_XBAR_ID_MOD_REV_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ID_Bits.MOD_REV */
#define IFX_XBAR_ID_MOD_REV_OFF (0)

/** \\brief  Length for Ifx_XBAR_ID_Bits.MOD_TYPE */
#define IFX_XBAR_ID_MOD_TYPE_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ID_Bits.MOD_TYPE */
#define IFX_XBAR_ID_MOD_TYPE_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ID_Bits.MOD_TYPE */
#define IFX_XBAR_ID_MOD_TYPE_OFF (8)

/** \\brief  Length for Ifx_XBAR_ID_Bits.MODNUMBER */
#define IFX_XBAR_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_XBAR_ID_Bits.MODNUMBER */
#define IFX_XBAR_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_XBAR_ID_Bits.MODNUMBER */
#define IFX_XBAR_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI0 */
#define IFX_XBAR_IDINTEN_ENMCI0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI0 */
#define IFX_XBAR_IDINTEN_ENMCI0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI0 */
#define IFX_XBAR_IDINTEN_ENMCI0_OFF (16)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI10 */
#define IFX_XBAR_IDINTEN_ENMCI10_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI10 */
#define IFX_XBAR_IDINTEN_ENMCI10_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI10 */
#define IFX_XBAR_IDINTEN_ENMCI10_OFF (26)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI11 */
#define IFX_XBAR_IDINTEN_ENMCI11_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI11 */
#define IFX_XBAR_IDINTEN_ENMCI11_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI11 */
#define IFX_XBAR_IDINTEN_ENMCI11_OFF (27)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI12 */
#define IFX_XBAR_IDINTEN_ENMCI12_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI12 */
#define IFX_XBAR_IDINTEN_ENMCI12_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI12 */
#define IFX_XBAR_IDINTEN_ENMCI12_OFF (28)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI13 */
#define IFX_XBAR_IDINTEN_ENMCI13_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI13 */
#define IFX_XBAR_IDINTEN_ENMCI13_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI13 */
#define IFX_XBAR_IDINTEN_ENMCI13_OFF (29)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI4 */
#define IFX_XBAR_IDINTEN_ENMCI4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI4 */
#define IFX_XBAR_IDINTEN_ENMCI4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI4 */
#define IFX_XBAR_IDINTEN_ENMCI4_OFF (20)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI5 */
#define IFX_XBAR_IDINTEN_ENMCI5_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI5 */
#define IFX_XBAR_IDINTEN_ENMCI5_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI5 */
#define IFX_XBAR_IDINTEN_ENMCI5_OFF (21)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI6 */
#define IFX_XBAR_IDINTEN_ENMCI6_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI6 */
#define IFX_XBAR_IDINTEN_ENMCI6_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI6 */
#define IFX_XBAR_IDINTEN_ENMCI6_OFF (22)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI8 */
#define IFX_XBAR_IDINTEN_ENMCI8_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI8 */
#define IFX_XBAR_IDINTEN_ENMCI8_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI8 */
#define IFX_XBAR_IDINTEN_ENMCI8_OFF (24)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI9 */
#define IFX_XBAR_IDINTEN_ENMCI9_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI9 */
#define IFX_XBAR_IDINTEN_ENMCI9_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI9 */
#define IFX_XBAR_IDINTEN_ENMCI9_OFF (25)

