keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxXbar_bf.h
/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI0 */
#define IFX_XBAR_IDINTEN_ENSCI0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI0 */
#define IFX_XBAR_IDINTEN_ENSCI0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI0 */
#define IFX_XBAR_IDINTEN_ENSCI0_OFF (0)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI10 */
#define IFX_XBAR_IDINTEN_ENSCI10_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI10 */
#define IFX_XBAR_IDINTEN_ENSCI10_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI10 */
#define IFX_XBAR_IDINTEN_ENSCI10_OFF (10)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI1 */
#define IFX_XBAR_IDINTEN_ENSCI1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI1 */
#define IFX_XBAR_IDINTEN_ENSCI1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI1 */
#define IFX_XBAR_IDINTEN_ENSCI1_OFF (1)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI2 */
#define IFX_XBAR_IDINTEN_ENSCI2_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI2 */
#define IFX_XBAR_IDINTEN_ENSCI2_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI2 */
#define IFX_XBAR_IDINTEN_ENSCI2_OFF (2)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI4 */
#define IFX_XBAR_IDINTEN_ENSCI4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI4 */
#define IFX_XBAR_IDINTEN_ENSCI4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI4 */
#define IFX_XBAR_IDINTEN_ENSCI4_OFF (4)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI5 */
#define IFX_XBAR_IDINTEN_ENSCI5_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI5 */
#define IFX_XBAR_IDINTEN_ENSCI5_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI5 */
#define IFX_XBAR_IDINTEN_ENSCI5_OFF (5)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI6 */
#define IFX_XBAR_IDINTEN_ENSCI6_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI6 */
#define IFX_XBAR_IDINTEN_ENSCI6_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI6 */
#define IFX_XBAR_IDINTEN_ENSCI6_OFF (6)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI7 */
#define IFX_XBAR_IDINTEN_ENSCI7_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI7 */
#define IFX_XBAR_IDINTEN_ENSCI7_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI7 */
#define IFX_XBAR_IDINTEN_ENSCI7_OFF (7)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI8 */
#define IFX_XBAR_IDINTEN_ENSCI8_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI8 */
#define IFX_XBAR_IDINTEN_ENSCI8_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI8 */
#define IFX_XBAR_IDINTEN_ENSCI8_OFF (8)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI9 */
#define IFX_XBAR_IDINTEN_ENSCI9_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI9 */
#define IFX_XBAR_IDINTEN_ENSCI9_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI9 */
#define IFX_XBAR_IDINTEN_ENSCI9_OFF (9)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCID */
#define IFX_XBAR_IDINTEN_ENSCID_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCID */
#define IFX_XBAR_IDINTEN_ENSCID_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCID */
#define IFX_XBAR_IDINTEN_ENSCID_OFF (15)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDCSCI0 */
#define IFX_XBAR_IDINTSAT_IDCSCI0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDCSCI0 */
#define IFX_XBAR_IDINTSAT_IDCSCI0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDCSCI0 */
#define IFX_XBAR_IDINTSAT_IDCSCI0_OFF (0)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDCSCI1 */
#define IFX_XBAR_IDINTSAT_IDCSCI1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDCSCI1 */
#define IFX_XBAR_IDINTSAT_IDCSCI1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDCSCI1 */
#define IFX_XBAR_IDINTSAT_IDCSCI1_OFF (1)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDCSCI2 */
#define IFX_XBAR_IDINTSAT_IDCSCI2_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDCSCI2 */
#define IFX_XBAR_IDINTSAT_IDCSCI2_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDCSCI2 */
#define IFX_XBAR_IDINTSAT_IDCSCI2_OFF (2)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI0 */
#define IFX_XBAR_IDINTSAT_IDMCI0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI0 */
#define IFX_XBAR_IDINTSAT_IDMCI0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI0 */
#define IFX_XBAR_IDINTSAT_IDMCI0_OFF (16)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI10 */
#define IFX_XBAR_IDINTSAT_IDMCI10_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI10 */
#define IFX_XBAR_IDINTSAT_IDMCI10_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI10 */
#define IFX_XBAR_IDINTSAT_IDMCI10_OFF (26)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI11 */
#define IFX_XBAR_IDINTSAT_IDMCI11_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI11 */
#define IFX_XBAR_IDINTSAT_IDMCI11_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI11 */
#define IFX_XBAR_IDINTSAT_IDMCI11_OFF (27)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI12 */
#define IFX_XBAR_IDINTSAT_IDMCI12_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI12 */
#define IFX_XBAR_IDINTSAT_IDMCI12_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI12 */
#define IFX_XBAR_IDINTSAT_IDMCI12_OFF (28)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI13 */
#define IFX_XBAR_IDINTSAT_IDMCI13_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI13 */
#define IFX_XBAR_IDINTSAT_IDMCI13_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI13 */
#define IFX_XBAR_IDINTSAT_IDMCI13_OFF (29)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI4 */
#define IFX_XBAR_IDINTSAT_IDMCI4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI4 */
#define IFX_XBAR_IDINTSAT_IDMCI4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI4 */
#define IFX_XBAR_IDINTSAT_IDMCI4_OFF (20)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI5 */
#define IFX_XBAR_IDINTSAT_IDMCI5_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI5 */
#define IFX_XBAR_IDINTSAT_IDMCI5_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI5 */
#define IFX_XBAR_IDINTSAT_IDMCI5_OFF (21)

