keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxXbar_bf.h
/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI6 */
#define IFX_XBAR_IDINTSAT_IDMCI6_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI6 */
#define IFX_XBAR_IDINTSAT_IDMCI6_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI6 */
#define IFX_XBAR_IDINTSAT_IDMCI6_OFF (22)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI8 */
#define IFX_XBAR_IDINTSAT_IDMCI8_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI8 */
#define IFX_XBAR_IDINTSAT_IDMCI8_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI8 */
#define IFX_XBAR_IDINTSAT_IDMCI8_OFF (24)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI9 */
#define IFX_XBAR_IDINTSAT_IDMCI9_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI9 */
#define IFX_XBAR_IDINTSAT_IDMCI9_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI9 */
#define IFX_XBAR_IDINTSAT_IDMCI9_OFF (25)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI10 */
#define IFX_XBAR_IDINTSAT_IDSCI10_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCI10 */
#define IFX_XBAR_IDINTSAT_IDSCI10_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCI10 */
#define IFX_XBAR_IDINTSAT_IDSCI10_OFF (10)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI4 */
#define IFX_XBAR_IDINTSAT_IDSCI4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCI4 */
#define IFX_XBAR_IDINTSAT_IDSCI4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCI4 */
#define IFX_XBAR_IDINTSAT_IDSCI4_OFF (4)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI5 */
#define IFX_XBAR_IDINTSAT_IDSCI5_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCI5 */
#define IFX_XBAR_IDINTSAT_IDSCI5_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCI5 */
#define IFX_XBAR_IDINTSAT_IDSCI5_OFF (5)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI6 */
#define IFX_XBAR_IDINTSAT_IDSCI6_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCI6 */
#define IFX_XBAR_IDINTSAT_IDSCI6_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCI6 */
#define IFX_XBAR_IDINTSAT_IDSCI6_OFF (6)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI7 */
#define IFX_XBAR_IDINTSAT_IDSCI7_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCI7 */
#define IFX_XBAR_IDINTSAT_IDSCI7_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCI7 */
#define IFX_XBAR_IDINTSAT_IDSCI7_OFF (7)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI8 */
#define IFX_XBAR_IDINTSAT_IDSCI8_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCI8 */
#define IFX_XBAR_IDINTSAT_IDSCI8_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCI8 */
#define IFX_XBAR_IDINTSAT_IDSCI8_OFF (8)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI9 */
#define IFX_XBAR_IDINTSAT_IDSCI9_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCI9 */
#define IFX_XBAR_IDINTSAT_IDSCI9_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCI9 */
#define IFX_XBAR_IDINTSAT_IDSCI9_OFF (9)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCID */
#define IFX_XBAR_IDINTSAT_IDSCID_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCID */
#define IFX_XBAR_IDINTSAT_IDSCID_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCID */
#define IFX_XBAR_IDINTSAT_IDSCID_OFF (15)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI0 */
#define IFX_XBAR_INTSAT_PRSCI0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI0 */
#define IFX_XBAR_INTSAT_PRSCI0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI0 */
#define IFX_XBAR_INTSAT_PRSCI0_OFF (16)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI10 */
#define IFX_XBAR_INTSAT_PRSCI10_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI10 */
#define IFX_XBAR_INTSAT_PRSCI10_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI10 */
#define IFX_XBAR_INTSAT_PRSCI10_OFF (26)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI1 */
#define IFX_XBAR_INTSAT_PRSCI1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI1 */
#define IFX_XBAR_INTSAT_PRSCI1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI1 */
#define IFX_XBAR_INTSAT_PRSCI1_OFF (17)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI2 */
#define IFX_XBAR_INTSAT_PRSCI2_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI2 */
#define IFX_XBAR_INTSAT_PRSCI2_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI2 */
#define IFX_XBAR_INTSAT_PRSCI2_OFF (18)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI4 */
#define IFX_XBAR_INTSAT_PRSCI4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI4 */
#define IFX_XBAR_INTSAT_PRSCI4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI4 */
#define IFX_XBAR_INTSAT_PRSCI4_OFF (20)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI5 */
#define IFX_XBAR_INTSAT_PRSCI5_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI5 */
#define IFX_XBAR_INTSAT_PRSCI5_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI5 */
#define IFX_XBAR_INTSAT_PRSCI5_OFF (21)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI6 */
#define IFX_XBAR_INTSAT_PRSCI6_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI6 */
#define IFX_XBAR_INTSAT_PRSCI6_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI6 */
#define IFX_XBAR_INTSAT_PRSCI6_OFF (22)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI7 */
#define IFX_XBAR_INTSAT_PRSCI7_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI7 */
#define IFX_XBAR_INTSAT_PRSCI7_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI7 */
#define IFX_XBAR_INTSAT_PRSCI7_OFF (23)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI8 */
#define IFX_XBAR_INTSAT_PRSCI8_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI8 */
#define IFX_XBAR_INTSAT_PRSCI8_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI8 */
#define IFX_XBAR_INTSAT_PRSCI8_OFF (24)

