keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxXbar_bf.h
/** \\brief  Mask for Ifx_XBAR_PRIOH_Bits.MASTER11 */
#define IFX_XBAR_PRIOH_MASTER11_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOH_Bits.MASTER11 */
#define IFX_XBAR_PRIOH_MASTER11_OFF (12)

/** \\brief  Length for Ifx_XBAR_PRIOH_Bits.MASTER12 */
#define IFX_XBAR_PRIOH_MASTER12_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOH_Bits.MASTER12 */
#define IFX_XBAR_PRIOH_MASTER12_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOH_Bits.MASTER12 */
#define IFX_XBAR_PRIOH_MASTER12_OFF (16)

/** \\brief  Length for Ifx_XBAR_PRIOH_Bits.MASTER13 */
#define IFX_XBAR_PRIOH_MASTER13_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOH_Bits.MASTER13 */
#define IFX_XBAR_PRIOH_MASTER13_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOH_Bits.MASTER13 */
#define IFX_XBAR_PRIOH_MASTER13_OFF (20)

/** \\brief  Length for Ifx_XBAR_PRIOH_Bits.MASTER8 */
#define IFX_XBAR_PRIOH_MASTER8_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOH_Bits.MASTER8 */
#define IFX_XBAR_PRIOH_MASTER8_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOH_Bits.MASTER8 */
#define IFX_XBAR_PRIOH_MASTER8_OFF (0)

/** \\brief  Length for Ifx_XBAR_PRIOH_Bits.MASTER9 */
#define IFX_XBAR_PRIOH_MASTER9_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOH_Bits.MASTER9 */
#define IFX_XBAR_PRIOH_MASTER9_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOH_Bits.MASTER9 */
#define IFX_XBAR_PRIOH_MASTER9_OFF (4)

/** \\brief  Length for Ifx_XBAR_PRIOL10_Bits.MASTER0 */
#define IFX_XBAR_PRIOL10_MASTER0_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOL10_Bits.MASTER0 */
#define IFX_XBAR_PRIOL10_MASTER0_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOL10_Bits.MASTER0 */
#define IFX_XBAR_PRIOL10_MASTER0_OFF (0)

/** \\brief  Length for Ifx_XBAR_PRIOL10_Bits.MASTER4 */
#define IFX_XBAR_PRIOL10_MASTER4_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOL10_Bits.MASTER4 */
#define IFX_XBAR_PRIOL10_MASTER4_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOL10_Bits.MASTER4 */
#define IFX_XBAR_PRIOL10_MASTER4_OFF (16)

/** \\brief  Length for Ifx_XBAR_PRIOL10_Bits.MASTER5 */
#define IFX_XBAR_PRIOL10_MASTER5_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOL10_Bits.MASTER5 */
#define IFX_XBAR_PRIOL10_MASTER5_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOL10_Bits.MASTER5 */
#define IFX_XBAR_PRIOL10_MASTER5_OFF (20)

/** \\brief  Length for Ifx_XBAR_PRIOL10_Bits.MASTER6 */
#define IFX_XBAR_PRIOL10_MASTER6_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOL10_Bits.MASTER6 */
#define IFX_XBAR_PRIOL10_MASTER6_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOL10_Bits.MASTER6 */
#define IFX_XBAR_PRIOL10_MASTER6_OFF (24)

/** \\brief  Length for Ifx_XBAR_PRIOL_Bits.MASTER0 */
#define IFX_XBAR_PRIOL_MASTER0_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOL_Bits.MASTER0 */
#define IFX_XBAR_PRIOL_MASTER0_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOL_Bits.MASTER0 */
#define IFX_XBAR_PRIOL_MASTER0_OFF (0)

/** \\brief  Length for Ifx_XBAR_PRIOL_Bits.MASTER4 */
#define IFX_XBAR_PRIOL_MASTER4_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOL_Bits.MASTER4 */
#define IFX_XBAR_PRIOL_MASTER4_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOL_Bits.MASTER4 */
#define IFX_XBAR_PRIOL_MASTER4_OFF (16)

/** \\brief  Length for Ifx_XBAR_PRIOL_Bits.MASTER5 */
#define IFX_XBAR_PRIOL_MASTER5_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOL_Bits.MASTER5 */
#define IFX_XBAR_PRIOL_MASTER5_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOL_Bits.MASTER5 */
#define IFX_XBAR_PRIOL_MASTER5_OFF (20)

/** \\brief  Length for Ifx_XBAR_PRIOL_Bits.MASTER6 */
#define IFX_XBAR_PRIOL_MASTER6_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOL_Bits.MASTER6 */
#define IFX_XBAR_PRIOL_MASTER6_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOL_Bits.MASTER6 */
#define IFX_XBAR_PRIOL_MASTER6_OFF (24)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXXBAR_BF_H */
